In [ ]:
# using jupiter to view the data 

import pandas
import wbdata
import os

In [69]:

gnha_ind = {"SE.ADT.LITR.ZS":"Literacy rate, adult total (% of people ages 15 and above)"}
                                                                 
df= wbdata.get_dataframe(indicators=gnha_ind, country='all',  keep_levels=False)
df.reset_index(level=df.index.names, inplace=True)

In [70]:
df.columns

Index(['country', 'date',
       'Literacy rate, adult total (% of people ages 15 and above)'],
      dtype='object')

In [71]:
df.head(10)

,country,date,"Literacy rate, adult total (% of people ages 15 and above)"
0,Arab World,2020,NaN
1,Arab World,2019,73.114250
2,Arab World,2018,72.869087
3,Arab World,2017,75.766823
4,Arab World,2016,74.840797
5,Arab World,2015,73.499390
6,Arab World,2014,75.713890
7,Arab World,2013,74.043579
8,Arab World,2012,74.435692
9,Arab World,2011,71.060608

In [73]:
df.to_csv (r'\wb_literacyrate.csv', index = False, header=True)

In [74]:
wbdata.search_countries("BR")

id    name
----  ----------------------------------------------------
BEA   East Asia & Pacific (IBRD-only countries)
BEC   Europe & Central Asia (IBRD-only countries)
BHI   IBRD countries classified as high income
BLA   Latin America & the Caribbean (IBRD-only countries)
BMN   Middle East & North Africa (IBRD-only countries)
BRA   Brazil
BRN   Brunei Darussalam
BSS   Sub-Saharan Africa (IBRD-only countries)
GIB   Gibraltar
IBB   IBRD, including blend
IBD   IBRD only
IBT   IDA & IBRD total
TEA   East Asia & Pacific (IDA & IBRD countries)
TEC   Europe & Central Asia (IDA & IBRD countries)
TLA   Latin America & the Caribbean (IDA & IBRD countries)
TMN   Middle East & North Africa (IDA & IBRD countries)
TSA   South Asia (IDA & IBRD)
TSS   Sub-Saharan Africa (IDA & IBRD countries)
VGB   British Virgin Islands